[
  {
    "thisSpecUrl": "https://drafts.csswg.org/css-writing-modes-4/",
    "abstract": "CSS Writing Modes Level 4 defines CSS support for various writing modes and their combinations, including left-to-right and right-to-left text ordering as well as horizontal and vertical orientations."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2018/WD-css-inline-3-20180808/",
    "abstract": "The CSS formatting model provides for a flow of elements and text inside of a container to be wrapped into lines.  The formatting of elements and text within a line, its positioning in the inline progression direction, and the breaking of lines are described in [CSS3TEXT].  This module describes the positioning in the block progression direction both of elements and text within lines and of the lines themselves.  This positioning is often relative to a baseline.  It also describes special features for formatting of first lines and drop caps.  It extends on the model in [CSS2]."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2012/CR-css3-background-20120417/",
    "abstract": "CSS is a language for describing the rendering of structured documents (such as HTML and XML) on screen, on paper,\n   in speech, etc. This draft contains the features of CSS level 3\n   relating to borders and backgrounds. It includes and extends the\n   functionality of CSS level 2 [CSS21], which builds on CSS\n   level 1 [CSS1].\n   The main extensions compared to level 2 are borders consisting of\n   images, boxes with multiple backgrounds, boxes with rounded corners and\n   boxes with shadows."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/css-position-3/",
    "abstract": "This module contains defines coordinate-based positioning and offsetting schemes of CSS: relative positioning, sticky positioning, absolute positioning, and fixed positioning."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2021/CRD-css-easing-1-20210401/",
    "abstract": "This CSS module describes a way for authors to define a transformation\n\n    that controls the rate of change of some value.\n    Applied to animations, such transformations can be used to produce\n    animations that mimic physical phenomena such as momentum or to cause the\n    animation to move in discrete steps producing robot-like movement."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2016/CR-css-cascade-4-20160114/",
    "abstract": "This CSS module describes how to collate style rules and assign values to all properties on all elements. By way of cascading and inheritance, values are propagated for all properties on all elements.New in this level are the revert keyword and <supports-condition> for the @import rule."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2019/CR-css-easing-1-20190430/",
    "abstract": "This CSS module describes a way for authors to define a transformation\n\n    that controls the rate of change of some value.\n    Applied to animations, such transformations can be used to produce\n    animations that mimic physical phenomena such as momentum or to cause the\n    animation to move in discrete steps producing robot-like movement."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2020/CR-css-backgrounds-3-20201222/",
    "abstract": "This draft contains the features of CSS relating to borders and backgrounds. The main extensions compared to level 2 are borders consisting of images, boxes with multiple backgrounds, boxes with rounded corners and boxes with shadows."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2021/WD-css-color-5-20211215/",
    "abstract": "This module extends CSS Color [css-color-4] to add color modification functions."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2024/WD-css-color-5-20240229/",
    "abstract": "This module extends CSS Color [css-color-4] to add color modification functions, custom color spaces (ICC profiles), light-dark() and device-cmyk()."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/mediaqueries-5/",
    "abstract": "Media Queries allow authors to test and query values or features of the user agent or display device, independent of the document being rendered.  They are used in the CSS @media rule to conditionally apply styles to a document, and in various other contexts and languages, such as HTML and JavaScript.Media Queries Level 5 describes the mechanism and syntax of media queries, media types, and media features. It extends and supersedes the features defined in Media Queries Level 4."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2018/WD-css-easing-1-20181009/",
    "abstract": "This CSS module describes a way for authors to define a transformation\n\nto be applied to the time of an animation. This can be used to produce\nanimations that mimic physical phenomena such as momentum or to\ncause the animation to move in discrete steps producing robot-like\nmovement."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/css-box-4/",
    "abstract": "This specification describes the margin and padding properties, which create spacing in and around a CSS box. It may later be extended to include borders (currently described in [css-backgrounds-3])."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2017/WD-css-timing-1-20170221/",
    "abstract": "This CSS module describes a way for authors to define a transformation\n\nto be applied to the time of an animation. This can be used to produce\nanimations that mimic physical phenomena such as momentum or to\ncause the animation to move in discrete steps producing robot-like\nmovement."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2018/WD-css-typed-om-1-20180410/",
    "abstract": "Converting CSSOM value strings into meaningfully typed JavaScript representations and back can incur a significant performance overhead. This specification exposes CSS values as typed JavaScript objects to facilitate their performant manipulation."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/css-cascade-3/",
    "abstract": "This CSS module describes how to collate style rules and assign values to all properties on all elements. By way of cascading and inheritance, values are propagated for all properties on all elements."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2021/WD-css-color-5-20210722/",
    "abstract": "This module extends CSS Color [css-color-4] to add color modification functions."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2019/WD-css-properties-values-api-1-20191025/",
    "abstract": "This CSS module defines an API for registering new CSS properties. Properties registered using this API are provided with a parse syntax that defines a type, inheritance behaviour, and an initial value."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/1999/WD-i18n-format-19990910/",
    "abstract": "The HyperText Markup Language (HTML) is a simple markup language used to\ncreate hypertext documents that are portable from one platform to another.\nHTML documents are SGML documents with generic semantics that are appropriate\nfor representing information from a wide range of applications. CSS is a\nstyle sheets language that can be applied to HTML to control the style of\na document: which fonts and colors to use, how much white space to insert,\netc. The following specification extends CSS to support East Asian and\nBi-directional text formatting. Familiarity with both CSS 2\n[CSS2] and HTML 4.0 [HTML4] is assumed."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2020/WD-css-position-3-20200519/",
    "abstract": "This module contains defines coordinate-based positioning and offsetting schemes of CSS: relative positioning, sticky positioning, absolute positioning, and fixed positioning."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2023/WD-css-view-transitions-1-20230530/",
    "abstract": "This module defines the View Transition API, along with associated properties and pseudo-elements."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2005/WD-css3-background-20050216",
    "abstract": "CSS (Cascading Style Sheets) is a language for describing the rendering of\nstructured documents (such as HTML and XML) on screen, on paper, in speech,\netc. This draft contains the proposed functionality for CSS level 3 to\ndescribe borders and backgrounds, including borders consisting of images and\nbackgrounds with multiple images. It includes and extends the functionality\nof CSS level 2 [CSS2], which builds on CSS level 1\n[CSS1]."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/css-animations-2/",
    "abstract": "This CSS module describes a way for authors to animate the values of CSS properties over time, using keyframes. The behavior of these keyframe animations can be controlled by specifying their duration, number of repeats, and repeating behavior."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2023/CRD-css-display-3-20230316/",
    "abstract": "This module describes how the CSS formatting box tree is generated from the document element tree and defines the display property that controls it."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2013/WD-cssom-20131205/",
    "abstract": "CSSOM defines APIs (including generic parsing and serialization rules)\nfor Media Queries, Selectors, and of course CSS itself."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2018/WD-css-align-3-20181206/",
    "abstract": "This module contains the features of CSS relating to the alignment of boxes within their containers in the various CSS box layout models: block layout, table layout, flex layout, and grid layout. (The alignment of text and inline-level content is defined in [CSS-TEXT-3] and [CSS-INLINE-3].)"
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2023/WD-css-animations-1-20230302/",
    "abstract": "This CSS module describes a way for authors to animate the values of CSS properties over time, using keyframes. The behavior of these keyframe animations can be controlled by specifying their duration, number of repeats, and repeating behavior."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2024/WD-css-conditional-5-20240723/",
    "abstract": "This module contains the features of CSS\nfor conditional processing of parts of style sheets,\nbased on capabilities of the processor or the environment\nthe style sheet is being applied in.\nIt includes and extends the functionality of CSS Conditional 4 [css-conditional-4],\nadding the generalized conditional rule @when and the chained conditional rule @else,\nas well as introducing font processing queries\nto the supports query syntax used in @supports rules,\nand container queries."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2024/WD-css-anchor-position-1-20241004/",
    "abstract": "This specification defines anchor positioning,\nwhere a positioned element can size and position itself\nrelative to one or more “anchor elements” elsewhere on the page."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2001/WD-css3-mediaqueries-20010404/",
    "abstract": "HTML4 and CSS2 currently support media-dependent style sheets\ntailored for different media types. For example, a document\nmay use sans-serif fonts when displayed on a screen and serif fonts\nwhen printed. \"Screen\" and \"print\" are two of the media types that\nhave been defined. To describe in more detail what type of devices a\nstyle sheet applies to, this document proposes media queries."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2024/WD-css-position-3-20240810/",
    "abstract": "This module contains defines coordinate-based positioning and offsetting schemes of CSS: relative positioning, sticky positioning, absolute positioning, and fixed positioning."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2015/WD-css3-positioning-20150203/",
    "abstract": "This module contains the features of CSS level 3 relating to positioning and stacking of elements. It includes and extends the functionality of CSS level 2 ([CSS21]), which builds on CSS level 1 [CSS1]. The main extensions compared to level 2 are the ability to position elements based on CSS Region boxes, the ability to specify different containing blocks for elements and sticky positioning. Other kinds of layout, such as tables, \"floating\" boxes, ruby annotations, grid layouts, columns and basic handling of normal \"flow\" content, are described in other modules. Also, the layout of text inside each line is defined elsewhere."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/css-color-5/",
    "abstract": "This module extends CSS Color [css-color-4] to add color modification functions, custom color spaces (ICC profiles), light-dark() and device-cmyk()."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2022/CR-css-values-3-20221201/",
    "abstract": "This CSS module describes the common values and units that CSS properties accept and the syntax used for describing them in CSS property definitions."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2018/CR-css-cascade-3-20180828/",
    "abstract": "This CSS module describes how to collate style rules and assign values to all properties on all elements. By way of cascading and inheritance, values are propagated for all properties on all elements."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2021/WD-css-fonts-5-20210629/",
    "abstract": "This specification defines modifications to the existing CSS Fonts 4 specification along with additional features."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/selectors-3/",
    "abstract": "Selectors are patterns that match\n   against elements in a tree, and as such form one of several technologies\n   that can be used to select nodes in an XML document. Selectors have been\n   optimized for use with HTML and XML, and are designed to be usable in\n   performance-critical code."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2024/CRD-css-color-4-20240213/",
    "abstract": "This specification describes CSS <color> values, and properties for foreground color and group opacity."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/web-animations-2/",
    "abstract": "This specification defines a model for synchronization and\n\n    timing of changes to the presentation of a Web page.\n    This specification also defines an application programming interface\n    for interacting with this model and it is expected that further\n    specifications will define declarative means for exposing these\n    features."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/css-shapes-1/",
    "abstract": "CSS Shapes describe geometric shapes for use in CSS. For Level 1, CSS Shapes can be applied to floats. A circle shape on a float will cause inline content to wrap around the circle shape instead of the float’s bounding box."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2012/WD-css3-values-20120308/",
    "abstract": "This CSS3 module describes the common values and units that CSS\n   properties accept and the syntax used for describing them in CSS property\n   definitions."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2017/WD-css-properties-values-api-1-20171109/",
    "abstract": "This CSS module defines an API for registering new CSS properties. Properties registered using this API are provided with a parse syntax that defines a type, inheritance behaviour, and an initial value."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2012/CR-css3-values-20120828/",
    "abstract": "This CSS3 module describes the common values and units that CSS\n   properties accept and the syntax used for describing them in CSS property\n   definitions."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2023/WD-web-animations-2-20230221/",
    "abstract": "This specification defines a model for synchronization and\n\n    timing of changes to the presentation of a Web page.\n    This specification also defines an application programming interface\n    for interacting with this model and it is expected that further\n    specifications will define declarative means for exposing these\n    features."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2011/WD-css3-text-20110215/",
    "abstract": "This CSS3 module defines properties for text manipulation and specifies\n   their processing model. It covers line breaking, justification and\n   alignment, white space handling, text decoration and text transformation."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2008/WD-css3-background-20080910",
    "abstract": "CSS is a language for describing the rendering of structured documents\n   (such as HTML and XML) on screen, on paper, in speech, etc. This draft\n   contains the features of CSS level 3 relating to borders and\n   backgrounds. It includes and extends the functionality of CSS level 2\n   [CSS21], which\n   builds on CSS level 1 [CSS1]. The main extensions compared to\n   level 2 are borders consisting of images, boxes with multiple\n   backgrounds, boxes with rounded corners and boxes with shadows."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2015/WD-css-pseudo-4-20150115/",
    "abstract": "This CSS module defines pseudo-elements, abstract elements that represent portions of the CSS render tree that can be selected and styled."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2019/WD-css-nav-1-20190423/",
    "abstract": "This specification defines a general model for navigating the focus using the arrow keys,\n\n    as well as related CSS, JavaScript features and Events."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2023/WD-scroll-animations-1-20230406/",
    "abstract": "Defines an API and markup for creating animations that are tied to\n\n          the scroll offset of a scroll container."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2015/CR-css-will-change-1-20151203/",
    "abstract": "This document defines the will-change CSS property, which allows an author to inform the UA ahead of time of what kinds of changes they are likely to make to an element.  This allows the UA to optimize how they handle the element ahead of time, performing potentially-expensive work preparing for an animation before the animation actually begins."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/css-break-4/",
    "abstract": "This module describes the fragmentation model that partitions a flow into pages, columns, or regions.\n\nIt builds on the Page model module and introduces and defines the fragmentation model.\nIt adds functionality for pagination, breaking variable fragment size and orientation, widows and orphans."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2021/WD-css-fonts-4-20210729/",
    "abstract": "This specification defines modifications to the existing CSS Fonts 3 specification along with additional features."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2022/CRD-css-shapes-1-20221115/",
    "abstract": "CSS Shapes describe geometric shapes for use in CSS. For Level 1, CSS Shapes can be applied to floats. A circle shape on a float will cause inline content to wrap around the circle shape instead of the float’s bounding box."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2011/WD-css3-speech-20110818/",
    "abstract": "CSS (Cascading Style Sheets) is a language that describes the rendering\n   of markup documents (e.g. HTML, XML) on various supports, such as screen,\n   paper, speech, etc. The Speech module defines aural CSS properties that\n   enable authors to declaratively control the rendering of documents via\n   speech synthesis, and using optional audio cues. The feature set exposed\n   by this specification is designed to match the model described by the\n   Speech Synthesis Markup Language (SSML) Version 1.1 [SSML]. Note that this standard was\n   developed in cooperation with the Voice\n   Browser Activity."
  },
  {
    "thisSpecUrl": "https://www.w3.org/pub/WWW/TR/WD-css1-960911.html",
    "abstract": "This document specifies level 1 of the Cascading Style Sheet\nmechanism (CSS1). CSS1 is a simple style sheet mechanism that allows\nauthors and readers to attach style (e.g. fonts, colors and spacing)\nto HTML documents. The CSS1 language is human readable and writable,\nand expresses style in common desktop publishing terminology."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2020/CRD-css-display-3-20201218/",
    "abstract": "This module describes how the CSS formatting box tree is generated from the document element tree and defines the display property that controls it."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2014/WD-css-flexbox-1-20140325/",
    "abstract": "The specification describes a CSS box model optimized for user interface design. In the flex layout model, the children of a flex container can be laid out in any direction, and can \"flex\" their sizes, either growing to fill unused space or shrinking to avoid overflowing the parent. Both horizontal and vertical alignment of the children can be easily manipulated. Nesting of these boxes (horizontal inside vertical, or vertical inside horizontal) can be used to build layouts in two dimensions.\nCSS is a language for describing the rendering of structured documents \n(such as HTML and XML) \non screen, on paper, in speech, etc."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2020/WD-css-sizing-3-20201023/",
    "abstract": "This module extends the CSS sizing properties with keywords that represent content-based \"intrinsic\" sizes and context-based \"extrinsic\" sizes, allowing CSS to more easily describe boxes that fit their content or fit into a particular layout context."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2011/WD-css3-flexbox-20111129/",
    "abstract": "The specification describes a CSS box model optimized for user interface\n   design. In flexbox layout model, the children of a box are laid out either\n   horizontally or vertically, and unused space can be assigned to a\n   particular child or distributed among the children by assignment of \"flex\"\n   to the children that should expand. Nesting of these boxes (horizontal\n   inside vertical, or vertical inside horizontal) can be used to build\n   layouts in two dimensions."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2015/CR-css-variables-1-20151203/",
    "abstract": "This module introduces cascading variables as a new primitive value type that is accepted by all CSS properties, and custom properties for defining them."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2023/WD-css-view-transitions-1-20230525/",
    "abstract": "This module defines the View Transition API, along with associated properties and pseudo-elements."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2010/PR-css3-color-20101028",
    "abstract": "CSS (Cascading Style Sheets) is a language for describing the rendering\n   of HTML and XML documents on screen, on paper, in speech, etc. It uses\n   color-related properties and values to color the text, backgrounds,\n   borders, and other parts of elements in a document. This specification\n   describes color values and properties for foreground color and group\n   opacity. These include properties and values from CSS level 2 and new\n   values."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/css-layout-api-1/",
    "abstract": "This specification describes an API which allows developers to layout a box in response to\n    computed style and box tree changes."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2020/WD-css-color-adjust-1-20200402/",
    "abstract": "This module introduces a model and controls over automatic color adjustment by the user agent to handle user preferences, such as \"Dark Mode\", contrast adjustment, or specific desired color schemes."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/compositing-1/",
    "abstract": "Compositing describes how shapes of different elements are combined into a single image. There are various possible approaches for compositing. Previous versions of SVG and CSS used Simple Alpha Compositing. In this model, each element is rendered into its own buffer and is then merged with its backdrop using the Porter Duff source-over operator. This specification will define a new compositing model that expands upon the Simple Alpha Compositing model by offering:"
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2018/REC-css-ui-3-20180621/",
    "abstract": "This specification describes user interface related\n\nproperties and values that are proposed for CSS level 3\nto style HTML and XML (including XHTML).\nIt includes and extends user interface related features from the\nproperties and values of CSS level 2 revision 1.\nIt uses various\nproperties and values to style basic user interface elements in a document."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/css-logical-1/",
    "abstract": "This module introduces logical properties and values that provide the author with the ability to control layout through logical, rather than physical, direction and dimension mappings. The module defines logical properties and values for the features defined in [CSS21]. These properties are writing-mode relative equivalents of their corresponding physical properties."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2008/REC-CSS2-20080411/",
    "abstract": "This specification defines Cascading Style Sheets, level 2\n(CSS2). CSS2 is a style sheet language that allows authors and users\nto attach style (e.g., fonts, spacing, and aural cues) to structured\ndocuments (e.g., HTML documents and XML applications). By separating\nthe presentation style of documents from the content of documents,\nCSS2 simplifies Web authoring and site maintenance."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2021/WD-css-overflow-3-20211202/",
    "abstract": "This module contains the features of CSS relating to scrollable overflow handling in visual media.\n\n\tThis level is focused on completing a precise specification for the existing overflow features,\n\tincluding the overflow property and its longhands; line-clamp, its longhands, and its legacy pre-standard syntax;\n\tand the text-overflow property.\n\tA few additional features introduced in support of [CSS-CONTAIN-1] and [CSS-CONTAIN-2] are also defined: overflow: clip and the overflow-clip-margin property."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/css-contain-2/",
    "abstract": "This CSS module describes the contain property, which indicates that the element’s subtree is independent of the rest of the page. This enables heavy optimizations by user agents when used well."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/css-will-change-1/",
    "abstract": "This document defines the will-change CSS property, which allows an author to inform the UA ahead of time of what kinds of changes they are likely to make to an element.  This allows the UA to optimize how they handle the element ahead of time, performing potentially-expensive work preparing for an animation before the animation actually begins."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2023/WD-css-font-loading-3-20230406/",
    "abstract": "This CSS module describes events and interfaces used for dynamically loading font resources."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2022/CRD-css-color-adjust-1-20220614/",
    "abstract": "This module introduces a model and controls over automatic color adjustment by the user agent to handle user preferences, such as \"Dark Mode\", contrast adjustment, or specific desired color schemes."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2023/WD-css-values-4-20230406/",
    "abstract": "This CSS module describes the common values and units that CSS properties accept and the syntax used for describing them in CSS property definitions."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2023/WD-css-nesting-1-20230214/",
    "abstract": "This module introduces the ability to nest one style rule inside another, with the selector of the child rule relative to the selector of the parent rule.  This increases the modularity and maintainability of CSS stylesheets."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2018/PR-css-fonts-3-20180814/",
    "abstract": "This CSS3 module describes how font properties are specified and how\n   font resources are loaded dynamically. The contents of this specification\n   are a consolidation of content previously divided into CSS3 Fonts\n   and CSS3\n   Web Fonts modules. The description of font load events was moved into\n   the CSS Font\n   Loading module."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2011/WD-cssom-20110712/",
    "abstract": "CSSOM defines APIs (including generic parsing and serialization rules)\n  for Media Queries, Selectors, and of course CSS itself."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2011/WD-css3-regions-20111129/",
    "abstract": "The CSS regions module allows content to flow across multiple areas\n   called regions. The regions are not necessarily contiguous in the document\n   order. The CSS regions module provides an advanced content flow mechanism,\n   which can be combined with positioning schemes as defined by other CSS\n   modules such as the Multi-Column Module [CSS3COL] or the Grid Layout Module\n   [CSS3-GRID-LAYOUT] to\n   position the regions where content flows."
  },
  {
    "thisSpecUrl": "https://drafts.fxtf.org/geometry/",
    "abstract": "This specification provides basic geometric interfaces to represent points, rectangles, quadrilaterals and transformation matrices that can be used by other modules or specifications."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2017/CR-css-break-3-20170209/",
    "abstract": "This module describes the fragmentation model that partitions a flow  into pages, columns, or regions.\n\nIt builds on the Page model module and introduces and defines the fragmentation model.\nIt adds functionality for pagination, breaking variable fragment size and orientation, widows and orphans."
  },
  {
    "thisSpecUrl": "https://drafts.csswg.org/css-logical-1/",
    "abstract": "This module introduces logical properties and values that provide the author with the ability to control layout through logical, rather than physical, direction and dimension mappings. The module defines logical properties and values for the features defined in [CSS2]. These properties are writing-mode relative equivalents of their corresponding physical properties."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2002/WD-css3-webfonts-20020802",
    "abstract": "This document presents a set of properties allowing font description by a\nuser agent. This specification is very close to the similar section in CSS 2\n[CSS2]. Only errata have been applied."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2021/WD-css-cascade-5-20210608/",
    "abstract": "This CSS module describes how to collate style rules and assign values to all properties on all elements. By way of cascading and inheritance, values are propagated for all properties on all elements.New in this level is cascade layers."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2024/CRD-compositing-1-20240321/",
    "abstract": "Compositing describes how shapes of different elements are combined into a single image. There are various possible approaches for compositing. Previous versions of SVG and CSS used Simple Alpha Compositing. In this model, each element is rendered into its own buffer and is then merged with its backdrop using the Porter Duff source-over operator. This specification will define a new compositing model that expands upon the Simple Alpha Compositing model by offering:"
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2020/WD-css-scroll-anchoring-1-20200211/",
    "abstract": "Changes in DOM elements above the visible region of a scrolling box can result in the page moving\n\nwhile the user is in the middle of consuming the content.This spec proposes a mechanism to mitigate this jarring user experience\n\nby keeping track of the position of an anchor node and adjusting the scroll offset accordingly.This spec also proposes an API for web developers to opt-out of this behavior."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2007/WD-css3-text-20070306/",
    "abstract": "This CSS3 module defines properties for text manipulation and\n    specifies their processing model. It covers line breaking, justification\n    and alignment, white space handling, text decoration and text\n    transformation."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2010/CR-css-style-attr-20101012/",
    "abstract": "Markup languages such as HTML [HTML401] and SVG [SVG11] provide a style attribute on\n   most elements, to hold inline style information that applies to those\n   elements. One of the possible style sheet languages is CSS. This draft\n   describes the syntax and interpretation of the CSS fragment that can be\n   used in such style attributes."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2021/WD-css-values-4-20211216/",
    "abstract": "This CSS module describes the common values and units that CSS properties accept and the syntax used for describing them in CSS property definitions."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2006/WD-css3-values-20060919",
    "abstract": "This CSS3 module describes the various values and units that CSS\n   properties accept. Also, it describes how values are computed from\n   \"specified\" (which is what the cascading process yields) through\n   \"computed\" and \"used\" into \"actual\" values. The main purpose of this\n   module is to define common values and units in one specification which can\n   be referred to by other modules. As such, it does not make sense to claim\n   conformance with this module alone."
  },
  {
    "thisSpecUrl": "https://drafts.csswg.org/css-scroll-snap-2/",
    "abstract": "This module contains features to control panning and scrolling behavior with “snap positions”."
  },
  {
    "thisSpecUrl": "https://drafts.csswg.org/css-grid/",
    "abstract": "This CSS module defines a two-dimensional grid-based layout system, optimized for user interface design. In the grid layout model, the children of a grid container can be positioned into arbitrary slots in a predefined flexible or fixed-size layout grid. Level 2 expands Grid by adding “subgrid” capabilities for nested grids to participate in the sizing of their parent grids."
  },
  {
    "thisSpecUrl": "http://dev.w3.org/csswg/css-scoping/",
    "abstract": "This specification defines scoping/encapsulation mechanisms for CSS, focusing on the Shadow DOM scoping mechanism."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2022/CR-css-conditional-3-20220113/",
    "abstract": "This module contains the features of CSS for conditional processing of parts of\n\n  style sheets, conditioned on capabilities of the processor or the\n  document the style sheet is being applied to.  It includes and extends the\n  functionality of CSS level 2 [CSS21], which builds on CSS level 1 [CSS1].  The main extensions compared to level 2 are allowing nesting of\n  certain at-rules inside @media, and the addition of the @supports rule for\n  conditional processing."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2024/WD-css-values-5-20240913/",
    "abstract": "This CSS module describes the common values and units that CSS properties accept and the syntax used for describing them in CSS property definitions."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2009/CR-CSS2-20090423",
    "abstract": "This specification defines Cascading Style Sheets, level 2\nrevision 1 (CSS 2.1). CSS 2.1 is a style sheet language\nthat allows\nauthors and users to attach style (e.g., fonts and spacing) to\nstructured documents (e.g., HTML documents and XML\napplications). By separating the presentation style of documents from\nthe content of documents, CSS 2.1 simplifies Web authoring and\nsite maintenance."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2017/WD-css-logical-1-20170518/",
    "abstract": "This module introduces logical properties and values that provide the author with the ability to control layout through logical, rather than physical, direction and dimension mappings. The module defines logical properties and values for the features defined in [CSS21]. These properties are writing-mode relative equivalents of their corresponding physical properties."
  },
  {
    "thisSpecUrl": "https://drafts.csswg.org/css-flexbox/",
    "abstract": "The specification describes a CSS box model optimized for user interface design. In the flex layout model, the children of a flex container can be laid out in any direction, and can “flex” their sizes, either growing to fill unused space or shrinking to avoid overflowing the parent. Both horizontal and vertical alignment of the children can be easily manipulated. Nesting of these boxes (horizontal inside vertical, or vertical inside horizontal) can be used to build layouts in two dimensions."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2011/WD-css3-writing-modes-20110901/",
    "abstract": "CSS Writing Modes Level 3 defines CSS features to support for various\n   international writing modes, such as left-to-right (e.g. Latin or Indic),\n   right-to-left (e.g. Hebrew or Arabic), bidirectional (e.g. mixed Latin and\n   Arabic) and vertical (e.g. Asian scripts)."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2014/WD-css-will-change-1-20140429/",
    "abstract": "This document defines the will-change CSS property, which allows an author to inform the UA ahead of time of what kinds of changes they are likely to make to an element.  This allows the UA to optimize how they handle the element ahead of time, performing potentially-expensive work preparing for an animation before the animation actually begins.\nCSS is a language for describing the rendering of structured documents \n(such as HTML and XML) \non screen, on paper, in speech, etc."
  },
  {
    "thisSpecUrl": "https://www.w3.org/TR/2022/WD-css-overflow-4-20221231/",
    "abstract": "This module contains the features of CSS relating to new mechanisms of overflow handling in visual media (e.g., screen or paper).  In interactive media, it describes features that allow the overflow from a fixed size container to be handled by pagination (displaying one page at a time).  It also describes features, applying to all visual media, that allow the contents of an element to be spread across multiple fragments, allowing the contents to flow across multiple regions or to have different styles for different fragments."
  }
]